Autodesk.Revit.DB.BuiltInParameter.POINT_ADAPTIVE_ORIENTATION_TYPE
"Orientation"

Autodesk.Revit.DB.BuiltInParameter.STAIRS_RAILING_PLACEMENT_OFFSET
"Tread/Stringer Offset"

Autodesk.Revit.DB.BuiltInParameter.RBS_ENERGY_ANALYSIS_INCLUDE_THERMAL_PROPERTIES
"Include Thermal Properties"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_BOTTOM_OF_PIPE
"Bottom of Pipe"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_TOP_OF_PIPE
"Top of Pipe"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PIPE_WEIGHT
"Weight"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PIPE_OUTSIDE_DIAMETER
"Outside Diameter"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PRODUCT_DATA_PRODUCT
"Product"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PRODUCT_DATA_ITEM_DESCRIPTION
"Item Description"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PRODUCT_DATA_SIZE_DESCRIPTION
"Size Description"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PRODUCT_DATA_MATERIAL_DESCRIPTION
"Material Description"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PRODUCT_DATA_SPECIFICATION
"Specification Description"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PRODUCT_DATA_LONG_DESCRIPTION
"Long Description"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PRODUCT_DATA_RANGE
"Range"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PRODUCT_DATA_FINISH_DESCRIPTION
"Finish Description"

Autodesk.Revit.DB.BuiltInParameter.RBS_SYSTEM_FABRICATION_SERVICE_PARAM
"Fabrication Service"

Autodesk.Revit.DB.BuiltInParameter.RBS_CONSTRUCTION_SET_PARAM
"Building Construction"

Autodesk.Revit.DB.BuiltInParameter.PATH_REIN_END_HOOK_ORIENT_2_WALL
"INTERNAL: Alternating Bar - End Hook Orientation"

Autodesk.Revit.DB.BuiltInParameter.PATH_REIN_END_HOOK_ORIENT_1_WALL
"INTERNAL: Primary Bar - End Hook Orientation"

Autodesk.Revit.DB.BuiltInParameter.PATH_REIN_END_HOOK_ORIENT_2_SLAB
"INTERNAL: Alternating Bar - End Hook Orientation"

Autodesk.Revit.DB.BuiltInParameter.PATH_REIN_END_HOOK_ORIENT_1_SLAB
"INTERNAL: Primary Bar - End Hook Orientation"

Autodesk.Revit.DB.BuiltInParameter.LOAD_CASE_CATEGORY
"Category"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_GEOMETRY_INVALID
"Incorrect Analytical Geometry"

Autodesk.Revit.DB.BuiltInParameter.ELEM_ARRAY_ALWAYS_VERTICAL
"Always vertical"

Autodesk.Revit.DB.BuiltInParameter.ELEM_ARRAY_ANCHORS_VISIBLE
"Anchor Points Visible"

Autodesk.Revit.DB.BuiltInParameter.ENERGY_ANALYSIS_MASSZONE_DIVIDEPERIMETER
"Divide Perimeter Zones"

Autodesk.Revit.DB.BuiltInParameter.ENERGY_ANALYSIS_MASSZONE_COREOFFSET
"Core Offset"

Autodesk.Revit.DB.BuiltInParameter.ENERGY_ANALYSIS_CONCEPTUAL_CONSTRUCTION
"Conceptual Constructions"

Autodesk.Revit.DB.BuiltInParameter.MASS_DATA_CONCEPTUAL_CONSTRUCTION
"Conceptual Constructions"

Autodesk.Revit.DB.BuiltInParameter.DEPRESSED_FLOOR_DEPTH
"Visibility range for floors, etc."

Autodesk.Revit.DB.BuiltInParameter.DETAIL_ARRAY_GROUP_ELEMENT_INST
"Component to Array"

Autodesk.Revit.DB.BuiltInParameter.DETAIL_ARRAY_GROUP_ELEMENT
"Component to Array"

Autodesk.Revit.DB.BuiltInParameter.SPACING_ORIENTATION_STEP_ALL
"Component Facing"

Autodesk.Revit.DB.BuiltInParameter.SPACING_INITIAL_ROTATION
"Initial Rotation"

Autodesk.Revit.DB.BuiltInParameter.SPACING_ORIENTATION_STEP2
"Complex Path Rule"

Autodesk.Revit.DB.BuiltInParameter.SPACING_ORIENTATION_STEP1_INST
"Component Facing"

Autodesk.Revit.DB.BuiltInParameter.MODEL_ARRAY_GROUP_ELEMENT_INST
"Component to Array"

Autodesk.Revit.DB.BuiltInParameter.SPACING_ORIENTATION_STEP1
"Component Facing"

Autodesk.Revit.DB.BuiltInParameter.MODEL_ARRAY_GROUP_ELEMENT
"Component to Array"

Autodesk.Revit.DB.BuiltInParameter.BASELINE_DIM_OFFSET
"Baseline Offset\nBaseline Offset"

Autodesk.Revit.DB.BuiltInParameter.VIEW_UNDERLAY_ID
"Underlay"

Autodesk.Revit.DB.BuiltInParameter.GRAPHIC_DISPLAY_OPTIONS_FOG
"Fog"

Autodesk.Revit.DB.BuiltInParameter.STRUCTURAL_FOOTING_TOP_ELEVATION
"Elevation at Top"

Autodesk.Revit.DB.BuiltInParameter.STRUCTURAL_FOOTING_BOTTOM_ELEVATION
"Elevation at Bottom"

Autodesk.Revit.DB.BuiltInParameter.CONTINUOUS_FOOTING_THICKNESS
"Foundation Thickness"